CSI API ETABS v1

# cPropMaterialGetTypeOAPI Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetTypeOAPI(
    	string Name,
    	ref eMatType MatType,
    	ref int SymType
    )

    Function GetTypeOAPI (
    	Name As String,
    	ByRef MatType As eMatType,
    	ByRef SymType As Integer
    ) As Integer

    Dim instance As cPropMaterial
    Dim Name As String
    Dim MatType As eMatType
    Dim SymType As Integer
    Dim returnValue As Integer

    returnValue = instance.GetTypeOAPI(Name,
    	MatType, SymType)

    int GetTypeOAPI(
    	String^ Name,
    	eMatType% MatType,
    	int% SymType
    )

    abstract GetTypeOAPI :
            Name : string *
            MatType : eMatType byref *
            SymType : int byref -> int

#### Parameters

Name

    Type: SystemString

MatType

    Type: ETABSv1eMatType

SymType

    Type: SystemInt32

#### Return Value

Type: Int32

See Also

#### Reference

cPropMaterial Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com